app/Models/M_kriteria.php

    public function getAllData()
    {
        return $this->db->table('kriteria')->get();
---
SELECT *
FROM `kriteria`

    public function tambah($data)
    {
        return $this->db->table('kriteria')->insert($data);
---
INSERT INTO `kriteria` (`nama_kriteria`, `deskripsi`) VALUES ('', 'pendahuluan')