app/Models/RoleModel.php

SELECT *
FROM `role`
---
    public function getrole()
    {
        # code...
        return $this->db->table('role')->get()->getResult();