app/Models/UserModel.php

    public function getuser($iduser = false)
    {
        # code...
        if ($iduser == false) {
            return $this->db->table('user')
                ->orderby('iduser', 'DESC')
                ->join('role', 'role.idrole = user.idrole')
                ->get()->getResult();
---
SELECT *
FROM `user`
JOIN `role` ON `role`.`idrole` = `user`.`idrole`
ORDER BY `iduser` DESC